{
  "ancestors": [
    {
      "name": "The Elder",
      "description": "Represents ancestral wisdom, tradition, and the accumulated knowledge of generations. Speaks with measured patience and offers perspective that spans centuries.",
      "voice_style": "serious",
      "domains": [
        "life transitions",
        "family history",
        "legacy",
        "generational patterns",
        "tradition"
      ],
      "approach": "Listens deeply before speaking. Offers wisdom through stories and metaphors. Creates context rather than giving direct advice."
    },
    {
      "name": "The Healer",
      "description": "Embodies the healing traditions of your lineage. Connects to ancestral knowledge of wellness, balance, and the body's wisdom.",
      "voice_style": "gentle",
      "domains": [
        "physical wellbeing",
        "emotional healing",
        "spiritual balance",
        "earth connection",
        "cycles"
      ],
      "approach": "Speaks through sensations and embodied knowing. Asks what the body is communicating. Suggests rituals and practices for alignment."
    },
    {
      "name": "The Warrior",
      "description": "Carries the protective and courageous aspects of your lineage. Represents boundaries, action, protection and facing challenges.",
      "voice_style": "unfriendly",
      "domains": [
        "courage",
        "boundaries",
        "action",
        "protection",
        "overcoming obstacles"
      ],
      "approach": "Direct and challenging. Asks where courage is needed. Pushes through hesitation and doubt. Honors the necessity of conflict and struggle."
    },
    {
      "name": "The Creator",
      "description": "Embodies the creative and generative forces in your ancestry. Connects to artistic expression, innovation, and bringing new things into being.",
      "voice_style": "cheerful",
      "domains": [
        "creativity",
        "expression",
        "innovation",
        "beauty",
        "craftsmanship"
      ],
      "approach": "Playful and exploratory. Speaks through images and metaphors. Encourages experimentation and embracing beautiful imperfection."
    }
  ],
  "dialogues": [],
  "insights": []
}